SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_icache.h
/* Bit fields for ICACHE IF */
#define _ICACHE_IF_RESETVALUE                   0x00000000UL                            /**< Default value for ICACHE_IF                 */
#define _ICACHE_IF_MASK                         0x00000107UL                            /**< Mask for ICACHE_IF                          */
#define ICACHE_IF_HITOF                         (0x1UL << 0)                            /**< Hit Overflow Interrupt Flag                 */
#define _ICACHE_IF_HITOF_SHIFT                  0                                       /**< Shift value for ICACHE_HITOF                */
#define _ICACHE_IF_HITOF_MASK                   0x1UL                                   /**< Bit mask for ICACHE_HITOF                   */
#define _ICACHE_IF_HITOF_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for ICACHE_IF                  */
#define ICACHE_IF_HITOF_DEFAULT                 (_ICACHE_IF_HITOF_DEFAULT << 0)         /**< Shifted mode DEFAULT for ICACHE_IF          */
#define ICACHE_IF_MISSOF                        (0x1UL << 1)                            /**< Miss Overflow Interrupt Flag                */
#define _ICACHE_IF_MISSOF_SHIFT                 1                                       /**< Shift value for ICACHE_MISSOF               */
#define _ICACHE_IF_MISSOF_MASK                  0x2UL                                   /**< Bit mask for ICACHE_MISSOF                  */
#define _ICACHE_IF_MISSOF_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ICACHE_IF                  */
#define ICACHE_IF_MISSOF_DEFAULT                (_ICACHE_IF_MISSOF_DEFAULT << 1)        /**< Shifted mode DEFAULT for ICACHE_IF          */
#define ICACHE_IF_AHITOF                        (0x1UL << 2)                            /**< Advanced Hit Overflow Interrupt Flag        */
#define _ICACHE_IF_AHITOF_SHIFT                 2                                       /**< Shift value for ICACHE_AHITOF               */
#define _ICACHE_IF_AHITOF_MASK                  0x4UL                                   /**< Bit mask for ICACHE_AHITOF                  */
#define _ICACHE_IF_AHITOF_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ICACHE_IF                  */
#define ICACHE_IF_AHITOF_DEFAULT                (_ICACHE_IF_AHITOF_DEFAULT << 2)        /**< Shifted mode DEFAULT for ICACHE_IF          */
#define ICACHE_IF_RAMERROR                      (0x1UL << 8)                            /**< RAM error Interrupt Flag                    */
#define _ICACHE_IF_RAMERROR_SHIFT               8                                       /**< Shift value for ICACHE_RAMERROR             */
#define _ICACHE_IF_RAMERROR_MASK                0x100UL                                 /**< Bit mask for ICACHE_RAMERROR                */
#define _ICACHE_IF_RAMERROR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for ICACHE_IF                  */
#define ICACHE_IF_RAMERROR_DEFAULT              (_ICACHE_IF_RAMERROR_DEFAULT << 8)      /**< Shifted mode DEFAULT for ICACHE_IF          */

/* Bit fields for ICACHE IEN */
#define _ICACHE_IEN_RESETVALUE                  0x00000000UL                            /**< Default value for ICACHE_IEN                */
#define _ICACHE_IEN_MASK                        0x00000107UL                            /**< Mask for ICACHE_IEN                         */
#define ICACHE_IEN_HITOF                        (0x1UL << 0)                            /**< Hit Overflow Interrupt Enable               */
#define _ICACHE_IEN_HITOF_SHIFT                 0                                       /**< Shift value for ICACHE_HITOF                */
#define _ICACHE_IEN_HITOF_MASK                  0x1UL                                   /**< Bit mask for ICACHE_HITOF                   */
#define _ICACHE_IEN_HITOF_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ICACHE_IEN                 */
#define ICACHE_IEN_HITOF_DEFAULT                (_ICACHE_IEN_HITOF_DEFAULT << 0)        /**< Shifted mode DEFAULT for ICACHE_IEN         */
#define ICACHE_IEN_MISSOF                       (0x1UL << 1)                            /**< Miss Overflow Interrupt Enable              */
#define _ICACHE_IEN_MISSOF_SHIFT                1                                       /**< Shift value for ICACHE_MISSOF               */
#define _ICACHE_IEN_MISSOF_MASK                 0x2UL                                   /**< Bit mask for ICACHE_MISSOF                  */
#define _ICACHE_IEN_MISSOF_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for ICACHE_IEN                 */
#define ICACHE_IEN_MISSOF_DEFAULT               (_ICACHE_IEN_MISSOF_DEFAULT << 1)       /**< Shifted mode DEFAULT for ICACHE_IEN         */
#define ICACHE_IEN_AHITOF                       (0x1UL << 2)                            /**< Advanced Hit Overflow Interrupt Enable      */
#define _ICACHE_IEN_AHITOF_SHIFT                2                                       /**< Shift value for ICACHE_AHITOF               */
#define _ICACHE_IEN_AHITOF_MASK                 0x4UL                                   /**< Bit mask for ICACHE_AHITOF                  */
#define _ICACHE_IEN_AHITOF_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for ICACHE_IEN                 */
#define ICACHE_IEN_AHITOF_DEFAULT               (_ICACHE_IEN_AHITOF_DEFAULT << 2)       /**< Shifted mode DEFAULT for ICACHE_IEN         */
#define ICACHE_IEN_RAMERROR                     (0x1UL << 8)                            /**< RAM error Interrupt Enable                  */
#define _ICACHE_IEN_RAMERROR_SHIFT              8                                       /**< Shift value for ICACHE_RAMERROR             */
#define _ICACHE_IEN_RAMERROR_MASK               0x100UL                                 /**< Bit mask for ICACHE_RAMERROR                */
#define _ICACHE_IEN_RAMERROR_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for ICACHE_IEN                 */
#define ICACHE_IEN_RAMERROR_DEFAULT             (_ICACHE_IEN_RAMERROR_DEFAULT << 8)     /**< Shifted mode DEFAULT for ICACHE_IEN         */

/** @} End of group EFM32PG28_ICACHE_BitFields */
/** @} End of group EFM32PG28_ICACHE */
/** @} End of group Parts */

#endif // EFM32PG28_ICACHE_H
